Repository: RafaelMF16/DinDin
Catalog: DinDin.AngularProject/src/locale/messages.*.xlf
Languages: es

source: Registrar Transação
es: Registrar transacción

source: O campo valor é obrigatório!
es: ¡El campo de valor es obligatorio!

source: Escolha uma data
es: Elija una fecha

source: O campo data é obrigatório!
es: ¡El campo de fecha es obligatorio!

source: Tipo da transação
es: Tipo de transacción

source: O campo tipo da transação é obrigatório!
es: ¡El campo tipo de transacción es obligatorio!

source: Categoria
es: Categoría

source: O campo categoria é obrigatório!
es: ¡El campo de categoría es obligatorio!

source: Descrição
es: Descripción

source: O campo descrição é obrigatório!
es: ¡El campo de descripción es obligatorio!

source: Salvar
es: Guardar

source: Fechar
es: Cerrar

source: Sair
es: Salir

source: Renda Total: {{ monthlySummary.totalIncome | currency: "BRL" }}
es: Total de ingresos: {{ monthlySummary.totalIncome | currency: "USD" }}

source: Total Gasto: {{ monthlySummary.totalExpense | currency: "BRL" }}
es: Total de gastos: {{ monthlySummary.totalExpense | currency: "USD" }}

source: Saldo: <span [ngClass]="monthlySummary.balance < 0 ? 'text-danger' : 'text-success'"> {{ monthlySummary.balance | currency: "BRL" }} </span>
es: Saldo: <span [ngClass]="monthlySummary.balance < 0 ? 'text-danger' : 'text-success'"> {{ monthlySummary.balance | currency: "USD" }} </span>

source: Resumo de {{ monthName() }}/{{ monthlySummary.year}}
es: Resumen de {{ monthName() }}/{{ monthlySummary.year}}

source: Visão geral das finanças do mês
es: Resumen de las finanzas del mes

source: <strong>Renda</strong>
es: <strong>Ingresos</strong>

source: {{ monthlySummary.totalIncome | currency: "BRL" }}
es: {{ monthlySummary.totalIncome | currency: "USD" }}

source: {{ monthlySummary.balance | currency: "BRL" }}
es: {{ monthlySummary.balance | currency: "USD" }}

source: Transações
es: Transacciones

source: <strong>Data:</strong> {{ transaction.transactionDate | date}}
es: <strong>Fecha:</strong> {{ transaction.transactionDate | date}}

source: <strong>Categoria:</strong> {{ transactionCategoryName() }}
es: <strong>Categoría:</strong> {{ transactionCategoryName() }}

source: você voltou!
es: ¡ha vuelto!

source: faça login com suas informações pessoais
es: inicie sesión con sus datos personales

source: entrar
es: login

source: criar conta
es: crear cuenta

source: O campo nome é obrigatório!
es: ¡El campo nombre es obligatorio!

source: O campo email é obrigatório!
es: ¡El campo Email es obligatorio!

source: Email inválido!
es: Dirección de correo electrónico no válida

source: O campo senha é obrigatório!
es: ¡El campo contraseña es obligatorio!

source: A senha deve conter no mínimo 8 caracteres!
es: ¡La contraseña debe contener al menos 8 caracteres!

source: A senha deve conter no máximo 50 caracteres!
es: ¡La contraseña debe contener un máximo de 50 caracteres!

source: inscrever-se
es: regístrate

source: Crie sua conta!
es: ¡Crea tu cuenta!

source: Insira seus dados pessoais
es: Introduzca sus datos personales

source: faça login
es: iniciar sesión

source: Entrar
es: Iniciar sesión

source: Você ainda não possui resumos mensais.
es: Aún no tiene ningún resumen mensual.

source: <i class="fa-solid fa-arrow-left"></i> Voltar
es: <i class="fa-solid fa-arrow-left"></i> Volver
